{
  "documentTitle": "Canada Strong: Mark Carney's Plan",
  "promises": [
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "Unleash free trade in Canada by Canada Day by tabling legislation to eliminate all federal barriers to interprovincial trade and labour mobility and to remove all federal exceptions under the Canada Free Trade Agreement.",
      "source_page": 4,
      "source_ref": 27
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "Achieve mutual recognition of credentials with provinces and territories so Canadians can work wherever they want.",
      "source_page": 4,
      "source_ref": 29
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "In cases where mutual recognition is not attainable, we will harmonize regulations to enhance labour mobility.",
      "source_page": 4,
      "source_ref": 31
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "Reduce red tape. We will require all relevant federal departments - such as Transport Canada, Natural Resources Canada, and Innovation, Science and Economic Development Canada to undertake reviews and to report on progress, within 60 days, on steps to eliminate outdated or unnecessary rules, reduce duplication or overlap with provincial rules, and streamline the administration of rules and the delivery of regulatory decisions.",
      "source_page": 4,
      "source_ref": 33
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "Protect our economic sovereignty by unlocking projects that grow our economy.",
      "source_page": 4,
      "source_ref": 34
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "We will work with provinces and territories and Indigenous Peoples to establish a list of nation-building projects that span provincial and territorial boundaries and deliver major economic and strategic benefits to Canadians.",
      "source_page": 4,
      "source_ref": 35
    },
    {
      "section": "UNITE",
      "subsection": "One Canadian Economy",
      "promise_text": "We will prioritize funding and assessment resources for these projects on an expedited basis.",
      "source_page": 4,
      "source_ref": 37
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Invest to build infrastructure that connects Canada, breaks down barriers, and brings people and economies closer together.",
      "source_page": 4,
      "source_ref": 40
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "We will work with all orders of government and Indigenous Peoples on critical infrastructure that connects communities.",
      "source_page": 4,
      "source_ref": 41
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Make the Confederation Bridge, Northumberland and Marine Atlantic, and the Coopérative de Transport Maritime et Aérien Ferries more affordable.",
      "source_page": 5,
      "source_ref": 46
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "We will ensure fair and equal treatment for PEI's bridge and ferry access.",
      "source_page": 5,
      "source_ref": 47
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build high-speed rail that connects communities between Windsor and Québec City.",
      "source_page": 5,
      "source_ref": 48
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Direct the Canadian Transportation Agency to develop a plan to address persistent complaints about accessibility on aircraft and other modes of transportation.",
      "source_page": 5,
      "source_ref": 49
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build new trade infrastructure that connects Canada through the new \\$5 billion Trade Diversification Corridors Fund, including ports, railways, airports, highways, and other trade enabling infrastructure.",
      "source_page": 5,
      "source_ref": 50
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "We will work in partnership with provinces, territories, and Indigenous Peoples to advance this work.",
      "source_page": 5,
      "source_ref": 52
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build the Arctic economy with more ports, highways, railways, and energy infrastructure, with a focus on dual-use infrastructure that grows our economy, reinforces our partnership with Indigenous communities, and secures our sovereignty.",
      "source_page": 5,
      "source_ref": 53
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Advance nation-building infrastructure projects through the recently doubled Indigenous Loan Guarantee Program from \\$5 billion to \\$10 billion and increasing the sectoral scope.",
      "source_page": 5,
      "source_ref": 54
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build out Canada's east-west electricity grid, a nation-building transmission project developed with provinces, territories, and Indigenous partners, and stakeholders.",
      "source_page": 5,
      "source_ref": 56
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "And we will open new markets for large electricity producers in Canada, such as Hydro-Québec and Manitoba Hydro, and enhance connectivity to low-emissions electricity needed for industry and the broader economy to reach net-zero emissions.",
      "source_page": 5,
      "source_ref": 58
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Make rural and small communities more affordable and accessible through investing an additional \\$250 million in the Rural Transit Solutions Fund.",
      "source_page": 5,
      "source_ref": 60
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "By working with provinces and territories, we will lower costs and further support the development, expansion, and operation of local, regional, and cross-Canada transit and bus solutions that help Canadians get to work, school, medical appointments, and visit loved ones.",
      "source_page": 5,
      "source_ref": 61
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Invest in digital infrastructure for the economy of tomorrow. We will catalyze the construction and development of Al infrastructure including data storage facilities, computing capacity, high speed, safe and reliable communication networks, and digital supply chain solutions to improve efficiency and reduce costs for Canadians.",
      "source_page": 5,
      "source_ref": 62
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "This will include improving rural broadband and reliable cell service that connects communities.",
      "source_page": 6,
      "source_ref": 64
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Provide disaster mitigation and recovery funding where infrastructure that connects Canada is under threat.",
      "source_page": 6,
      "source_ref": 65
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build critical health infrastructure like hospitals, clinics, and long-term care facilities by working with provinces and territories.",
      "source_page": 6,
      "source_ref": 67
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Build community infrastructure that brings communities together. We will engage with municipalities that make progress on housing first.",
      "source_page": 6,
      "source_ref": 68
    },
    {
      "section": "UNITE",
      "subsection": "Nation-building Projects",
      "promise_text": "Make buildings more accessible by increasing funding to the Enabling Accessibility Fund to ensure that workplaces are accessible and incorporating more barrier-free and barrier-free ready designs into upcoming housing catalogues and into Canada's building efforts so that new housing is accessible to all Canadians.",
      "source_page": 6,
      "source_ref": 69
    },
    {
      "section": "UNITE",
      "subsection": "Getting Projects Done Faster and Better",
      "promise_text": "Get big projects built quickly by establishing \"One Window\" project decisions through a Major Federal Project Office and effectively shifting the focus of project review from \"why\" to \"how.\"",
      "source_page": 6,
      "source_ref": 76
    },
    {
      "section": "UNITE",
      "subsection": "Getting Projects Done Faster and Better",
      "promise_text": "Require the new Major Federal Project Office to render final decisions on projects on a maximum two-year timeline, much faster than the former government's five-year timeline.",
      "source_page": 6,
      "source_ref": 79
    },
    {
      "section": "UNITE",
      "subsection": "Getting Projects Done Faster and Better",
      "promise_text": "Move forward with One Project, One Review. Within six months, we will sign Cooperation and Substitution Agreements with all willing Premiers, as well as Indigenous Governing Bodies, allowing the federal government to recognize provincial, territorial, and Indigenous-led assessments.",
      "source_page": 6,
      "source_ref": 81
    },
    {
      "section": "UNITE",
      "subsection": "Getting Projects Done Faster and Better",
      "promise_text": "Advance Indigenous participation in major projects to ensure First Nations, Inuit and Métis rights-holders are a part of Canada's accelerated push to build.",
      "source_page": 7,
      "source_ref": 86
    },
    {
      "section": "UNITE",
      "subsection": "Getting Projects Done Faster and Better",
      "promise_text": "Double capacity support so more Indigenous communities can take an active role in project decisions at various stages, and to improve meaningful and immediate participation.",
      "source_page": 7,
      "source_ref": 87
    },
    {
      "section": "UNITE",
      "subsection": "Reinforcing CBC/Radio-Canada, Protecting Canadian Voices",
      "promise_text": "Enshrine and protect CBC/Radio Canada by introducing legislation to establish statutory funding.",
      "source_page": 7,
      "source_ref": 98
    },
    {
      "section": "UNITE",
      "subsection": "Reinforcing CBC/Radio-Canada, Protecting Canadian Voices",
      "promise_text": "Strengthen CBC/Radio Canada's mandate by: Developing a governance plan with CBC/Radio Canada to improve accountability, empower leadership, streamline processes and tap into the spirit of innovation; Equipping them to further promote and support Canadian culture including Quebec's unique culture; Strengthening local news; Adding to their mandate the clear and consistent transmission of life-saving information during emergencies; Including a commitment of including Indigenous perspectives; Fully equipping them to combat disinformation; Bolstering innovation and investing in new digital tools.",
      "source_page": 7,
      "source_ref": 101
    },
    {
      "section": "UNITE",
      "subsection": "Reinforcing CBC/Radio-Canada, Protecting Canadian Voices",
      "promise_text": "Provide an initial \\$150 million boost in annual funding while directing CBC/Radio Canada to develop a strategic plan consistent with this new mandate.",
      "source_page": 8,
      "source_ref": 110
    },
    {
      "section": "UNITE",
      "subsection": "Reinforcing CBC/Radio-Canada, Protecting Canadian Voices",
      "promise_text": "We will work towards bringing CBC/Radio Canada's long-term funding levels in line with the average funding of other national public broadcasters over time.",
      "source_page": 8,
      "source_ref": 111
    },
    {
      "section": "UNITE",
      "subsection": "Reinforcing CBC/Radio-Canada, Protecting Canadian Voices",
      "promise_text": "Support Canadian artists and creators by increasing funding to agencies such as the Canada Council for the Arts, Telefilm, the Canada Media Fund, and the National Film Board, recognizing the economic importance of Canada's creative industries and creators.",
      "source_page": 8,
      "source_ref": 112
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "Introduce a Canada Strong Pass for three months this summer.",
      "source_page": 8,
      "source_ref": 117
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "We will work with willing provinces and territories to establish similar pricing structures in our beautiful provincial museums and galleries.",
      "source_page": 8,
      "source_ref": 119
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "This pass will be available from June to August 2025.",
      "source_page": 8,
      "source_ref": 120
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "We will also introduce heavily discounted access and fares for young Canadians aged 18-24.",
      "source_page": 8,
      "source_ref": 120
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "Make access to National Parks and Historic Sites free this summer for everyone.",
      "source_page": 9,
      "source_ref": 122
    },
    {
      "section": "UNITE",
      "subsection": "Discovering and Celebrating Canada",
      "promise_text": "We will also reduce prices for camping sites in national parks for all Canadians from June to August.",
      "source_page": 9,
      "source_ref": 123
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Make it easy for Canadians to Buy Canadian. Working with retailers, agricultural producers, manufacturers, food and beverage companies, and by maximizing Canada's supply chain we will increase transparency and increase stringency in origin of product labelling so that it is simple, clear, and easy to identify what is a truly Canadian product.",
      "source_page": 9,
      "source_ref": 131
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "To help make this happen, we will provide support to help manufacturers adapt and for the Competition Bureau to enforce these new requirements.",
      "source_page": 9,
      "source_ref": 133
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Deploy a made-in-Canada procurement strategy that prioritizes, whenever possible, Canadian suppliers and supply chains, and limiting bidders from foreign suppliers to bidding only on what we have agreed to in Canada's Free Trade Agreements.",
      "source_page": 9,
      "source_ref": 134
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "We will prioritize Canadian contractors in our defence procurement, including the Canadian aerospace industry.",
      "source_page": 9,
      "source_ref": 135
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Crown Corporations with major capital acquisitions, like VIA Rail, will also be encouraged to meet this standard.",
      "source_page": 9,
      "source_ref": 136
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Buy Canadian clean by prioritizing Government of Canada purchases to be low carbon emission and when applicable, sustainability certified products and materials.",
      "source_page": 9,
      "source_ref": 137
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "We will support clean growth in Canada, create jobs, and support Canadian business.",
      "source_page": 9,
      "source_ref": 139
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Establish Buy Canadian standards for federal infrastructure funding including maximizing Canadian steel, aluminum, and forestry products.",
      "source_page": 9,
      "source_ref": 140
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Leverage government funding to prioritize and procure Canadian-built vehicles, catalyzing domestic investment to grow the Canadian auto industry.",
      "source_page": 9,
      "source_ref": 141
    },
    {
      "section": "UNITE",
      "subsection": "Buy Canadian",
      "promise_text": "Bet on Canadian innovators and entrepreneurs by leveraging the government's purchasing power to drive Canadian innovation, solving Canadian problems in new ways, and improving efficiency and service delivery, while supporting our small and medium-sized businesses.",
      "source_page": 9,
      "source_ref": 142
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "We will rebuild our defence capacity, we will rearm the Canadian Armed Forces, and we will invest in Canadian defence companies.",
      "source_page": 10,
      "source_ref": 151
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "We will strengthen our security, build stronger links with our partners in Europe and Asia, and invest in the North.",
      "source_page": 10,
      "source_ref": 152
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "We will build our defence industry to keep it resilient and benefit our economy.",
      "source_page": 10,
      "source_ref": 153
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "Most importantly, we will put Canadians first by supporting our people and making the Canadian Armed Forces a lifelong career.",
      "source_page": 10,
      "source_ref": 154
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "Our investments will be spent wisely and effectively to put Canada on track to exceed our NATO defence spending target before 2030.",
      "source_page": 10,
      "source_ref": 155
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Sovereignty",
      "promise_text": "We will increase investments significantly and quickly to protect Canada.",
      "source_page": 10,
      "source_ref": 156
    },
    {
      "section": "SECURE",
      "subsection": "Rebuild the Canadian Armed Forces",
      "promise_text": "Give a pay raise to CAF members to recognize that we are asking more of them as Canada steps up to defend our sovereignty.",
      "source_page": 11,
      "source_ref": 162
    },
    {
      "section": "SECURE",
      "subsection": "Rebuild the Canadian Armed Forces",
      "promise_text": "Give better support to our CAF members, through investments in housing, health care, and child care.",
      "source_page": 11,
      "source_ref": 163
    },
    {
      "section": "SECURE",
      "subsection": "Rebuild the Canadian Armed Forces",
      "promise_text": "Modernize our recruitment process, including by streamlining security clearances and applying online, so that more applicants can get trained, faster.",
      "source_page": 11,
      "source_ref": 165
    },
    {
      "section": "SECURE",
      "subsection": "Rebuild the Canadian Armed Forces",
      "promise_text": "Address the external recommendations to combat military sexual misconduct.",
      "source_page": 11,
      "source_ref": 168
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Expand our ability to monitor our coastlines and secure Canada's Arctic, including with new submarines for the Royal Canadian Navy and additional heavy icebreakers, building on our commitment to all orders underway through the National Shipbuilding Strategy.",
      "source_page": 11,
      "source_ref": 174
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Expand our fleet of aerial and underwater drones to build a persistent presence in the air and sea, including persistent surveillance to protect against threats in the Arctic and at our border.",
      "source_page": 11,
      "source_ref": 175
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "We will work to build Canadian industry through defence partnerships and by leveraging domestic innovations.",
      "source_page": 11,
      "source_ref": 176
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Buy Canadian-made airborne early warning and control aircraft, supporting our domestic aerospace industry and accelerating the procurement process.",
      "source_page": 11,
      "source_ref": 177
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Support the Canadian Army with significant new investments, such as new self-propelled artillery systems and ground-based air defence capabilities so that the CAF have the capacity to operate in today's context.",
      "source_page": 12,
      "source_ref": 179
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Give the Canadian Coast Guard a new mandate and the right equipment to conduct maritime surveillance operations to secure our coasts.",
      "source_page": 12,
      "source_ref": 180
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Expanding the reach and abilities of the Canadian Coast Guard will also mean integrating them into Canada's NATO defence capabilities.",
      "source_page": 12,
      "source_ref": 182
    },
    {
      "section": "SECURE",
      "subsection": "Rearm",
      "promise_text": "Invest in our Reserves and Canadian Rangers to give them the equipment they need to continue protecting our sovereignty and conduct domestic disaster responses that directly helps Canadians.",
      "source_page": 12,
      "source_ref": 183
    },
    {
      "section": "SECURE",
      "subsection": "Reinvest",
      "promise_text": "Establish the Bureau of Research, Engineering and Advanced Leadership in Science (BOREALIS) to ensure the Canadian Armed Forces and Communications Security Establishment have the made-in-Canada innovation solutions they need in areas such as Al, quantum computing, cybersecurity, and other advanced research and technology.",
      "source_page": 12,
      "source_ref": 190
    },
    {
      "section": "SECURE",
      "subsection": "Reinvest",
      "promise_text": "Overhaul defence procurement to better meet our needs and the urgency of the moment by: Establishing a new Defence Procurement Agency; Amending legislation and regulations as required, including taking steps to expand risk-based approaches to approvals, to centralize expertise from across government and streamline the way we buy equipment for the military; Buying Canadian whenever possible and prioritizing Canadian raw materials such as steel, aluminum and critical minerals.",
      "source_page": 12,
      "source_ref": 191
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Work closely with Arctic and Northern Indigenous leadership as partners, in defence and security investments that respect their rights, incorporate traditional knowledge, and ensure community priorities are reflected, especially on targeted investments in dual-use infrastructure such as airstrips and other critical infrastructure.",
      "source_page": 13,
      "source_ref": 206
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Strengthen the presence of Canadian Armed Forces in the Arctic to protect the sovereignty of our land, air, and sea, including through a network of deepwater ports that will allow us to protect the Northwest Passage year-round.",
      "source_page": 13,
      "source_ref": 207
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Move forward to detect and deter early warning radar coverage of threats to the Arctic by working with partners in Australia to develop advanced Over-the-Horizon Radar.",
      "source_page": 13,
      "source_ref": 208
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Invest in Northern infrastructure, including a new hydroelectricity project and other energy projects, so that people have access to safe, reliable energy; improve housing stock, accelerate housing development, and meet growing housing demand.",
      "source_page": 13,
      "source_ref": 210
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "We will also invest in new port projects, railways, airstrips, and highways, all with dual-use capabilities.",
      "source_page": 13,
      "source_ref": 212
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Forge a new Canada-Europe Arctic security cooperation agreement that deepens ties in the North in recognition of the rapidly shifting security landscape.",
      "source_page": 14,
      "source_ref": 214
    },
    {
      "section": "SECURE",
      "subsection": "Arctic Sovereignty and Prosperity",
      "promise_text": "Expand our fleet of aerial and underwater drones - as well as investments in Canadian satellite technology - to build a persistent presence across the North to monitor our vast landscape and the world's longest coastline by investing in made-in-Canada innovations.",
      "source_page": 14,
      "source_ref": 215
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Improve health services and support for women Veterans' health by launching a health research study on the experience of women Veterans to ensure proper data is collected so that its service delivery can capture the increase of women Veterans transitioning to civilian life and ultimately improve their health outcomes.",
      "source_page": 14,
      "source_ref": 220
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Modernize and streamline the benefits system, to deliver faster decisions, shorter wait times, and less paperwork so that Veterans and their families get the support they need sooner and more easily.",
      "source_page": 14,
      "source_ref": 221
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Make it easier for Veterans to get jobs by working with provinces and territories to streamline the recognition of military trade credentials in the civilian world, so that qualified Veterans do not needlessly retrain once they leave the military.",
      "source_page": 14,
      "source_ref": 222
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "We will also work to make it easier to maintain a security clearance when necessary after retirement so Veterans can continue contributing to the protection of Canadian sovereignty.",
      "source_page": 14,
      "source_ref": 223
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Expand recognition of service by reviewing the designation of certain military missions, including in the Persian Gulf, so that Veterans' sacrifices in conflict zones are properly recognized.",
      "source_page": 14,
      "source_ref": 224
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Expand culturally relevant services for Indigenous Veterans in consultation with First Nation, Inuit, and Métis peoples.",
      "source_page": 14,
      "source_ref": 226
    },
    {
      "section": "SECURE",
      "subsection": "Veterans",
      "promise_text": "Preserve the National Field of Honour through work with the Last Post Fund to assume ownership of the National Field of Honour in Montreal, so that it remains an appropriate and respectful final resting place for Veterans.",
      "source_page": 14,
      "source_ref": 228
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "Respond to existing U.S. tariffs on our economy for as long as is necessary while also ensuring that we are safeguarding Canadian industry from the threat of trade diversion.",
      "source_page": 15,
      "source_ref": 234
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "Create a \\$2 billion Strategic Response Fund to boost our auto sector's competitiveness, protect manufacturing jobs, support workers to upskill their expertise in the industry, and build a fortified Canadian supply chain - from raw materials to finished vehicles.",
      "source_page": 15,
      "source_ref": 236
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "Build an \"All-in-Canada\" network for auto manufacturing component parts.",
      "source_page": 15,
      "source_ref": 237
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "With this network, we will work with industry to build more car parts in Canada, limit those parts crossing the border during production, and attract investment into our own industry.",
      "source_page": 15,
      "source_ref": 238
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "Maximize Canada's steel, aluminum, and critical minerals - from exploration to battery production to seize this economic opportunity, create higher-paying jobs, and build the strongest economy in the G7.",
      "source_page": 15,
      "source_ref": 239
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "Safeguard our economy and our values and protect Canada from attempts to buy up our businesses, our core public health care, intellectual property, critical minerals and other resources by strengthening the Investment Canada Act.",
      "source_page": 15,
      "source_ref": 240
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "We will make more transactions reviewable, as well as modernizing standards to capture manipulative transaction models including by reviewing the potential impacts to Canada's data sovereignty.",
      "source_page": 15,
      "source_ref": 241
    },
    {
      "section": "SECURE",
      "subsection": "Defending Our Economy",
      "promise_text": "We will also make clear that any transactions involving core infrastructure in our public health system, such as long-term care facilities and family health practices, will be subject to stringent review and protection under the Act.",
      "source_page": 15,
      "source_ref": 242
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Strengthen Canada's food security by investing in greenhouses, hydroponics, and other controlled environment agriculture that allow us to grow more types of food, here at home.",
      "source_page": 16,
      "source_ref": 252
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "We will work with the private sector to protect Canadian food security.",
      "source_page": 16,
      "source_ref": 253
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Work to increase the resilience of food supply chains and support innovation.",
      "source_page": 16,
      "source_ref": 254
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Amend the mandates of the Canadian Food Inspection Agency and the Pest Management Regulatory Agency to ensure they consider food security and the cost of food in all their regulatory decisions without compromising on health and safety.",
      "source_page": 16,
      "source_ref": 255
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Direct the Canada Infrastructure Bank to prioritize investments in agriculture, fisheries, agri-food, and the food supply chain, particularly those that improve food security and reduce the cost of food for Canadian families, unlocking potentially billions in investment for the sector.",
      "source_page": 16,
      "source_ref": 257
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Help Canadian farmers get their goods to market at low cost, particularly in Alberta, Manitoba, and Saskatchewan.",
      "source_page": 16,
      "source_ref": 258
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "We will do this by extending the Extended Railway Interswitching pilot by three years.",
      "source_page": 16,
      "source_ref": 259
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "As part of our commitment to support Canadian workers, we will explore all options to exclude non-Canadian railways from being included in this project.",
      "source_page": 16,
      "source_ref": 260
    },
    {
      "section": "SECURE",
      "subsection": "Food Security",
      "promise_text": "Support modern water management practices and safeguard local water resources as part of the freshwater action plan.",
      "source_page": 16,
      "source_ref": 261
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Keep Canada's supply management off the table in any negotiations with the U.S. We will protect Canada's commitment to supply management and supply-managed sectors, including dairy, poultry, and eggs.",
      "source_page": 16,
      "source_ref": 264
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Make permanent the doubling of revenue protection for farmers under the AgriStability Program, from \\$3 million to \\$6 million per farm, in the case of significant revenue drops caused by tariffs, extreme weather events, and other external shocks.",
      "source_page": 16,
      "source_ref": 266
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Build more domestic processing capacity, including food processing capacity in rural and remote areas, with a new \\$200 million Domestic Food Processing Fund, applicable to both agricultural and fisheries products.",
      "source_page": 17,
      "source_ref": 268
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Increase support for farmers, ranchers, and producers, including in the fish and seafood sectors, to access new markets for their food products with an additional \\$30 million in the AgriMarketing Program.",
      "source_page": 17,
      "source_ref": 269
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Increase the support for farmers and ranchers to buy more efficient farm equipment.",
      "source_page": 17,
      "source_ref": 271
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Double the loan guarantee limit, from \\$500,000 to \\$1 million, of the Canadian Agricultural Loans Act Program and expand terms to 20 years.",
      "source_page": 17,
      "source_ref": 273
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Work with the National School Food Program and provinces and territories to prioritize the purchasing of Canadian food products as much as possible, supporting our farmers and ensuring Canadian kids have access to local, fresh food grown and caught right here in Canada.",
      "source_page": 17,
      "source_ref": 275
    },
    {
      "section": "SECURE",
      "subsection": "Farmers and Agri food",
      "promise_text": "Work with the Canada Food Inspection Agency to ensure mutual recognition of food safety standards with reliable trading partners.",
      "source_page": 17,
      "source_ref": 276
    },
    {
      "section": "SECURE",
      "subsection": "Fishers",
      "promise_text": "Invest an additional \\$250 million in the repair and maintenance of small craft harbours.",
      "source_page": 17,
      "source_ref": 281
    },
    {
      "section": "SECURE",
      "subsection": "Fishers",
      "promise_text": "Help our fisheries respond to tariffs and reduce the risk involved in expanding to new markets by creating a new Arctic Fisheries Fund, and revamping the Atlantic Fisheries Fund, the Quebec Fisheries Fund, and the British Columbia Salmon Restoration and Innovation Fund, increasing funding by 20% for each.",
      "source_page": 17,
      "source_ref": 284
    },
    {
      "section": "SECURE",
      "subsection": "Fishers",
      "promise_text": "Protect marine life and clean up our shores. We will work to clean up ghost gear through new innovations, such as Al-powered data analysis and satellite imagery, GPS-enabled buoys, RFID tags, and acoustic sensors to retrieve ghost gear in real time.",
      "source_page": 18,
      "source_ref": 289
    },
    {
      "section": "SECURE",
      "subsection": "Responsible Gun Control",
      "promise_text": "Continue to implement an efficient gun buyback program for assault-style firearms.",
      "source_page": 18,
      "source_ref": 299
    },
    {
      "section": "SECURE",
      "subsection": "Responsible Gun Control",
      "promise_text": "Legislate a pre-authorization system that ensures that the classification of new firearm models entering the market is determined by the RCMP and not the gun industry.",
      "source_page": 18,
      "source_ref": 300
    },
    {
      "section": "SECURE",
      "subsection": "Responsible Gun Control",
      "promise_text": "Automatically revoke gun licences for individuals convicted of violent offences, particularly those convicted of intimate partner violence offences, and those subject to protection orders.",
      "source_page": 18,
      "source_ref": 301
    },
    {
      "section": "SECURE",
      "subsection": "Responsible Gun Control",
      "promise_text": "Increase capacity to track down guns used in crimes so we can catch those responsible by investing in the capacity of the RCMP's National Forensic Laboratories in Ottawa and Surrey, as well as the Saskatchewan Ballistics Laboratory.",
      "source_page": 18,
      "source_ref": 302
    },
    {
      "section": "SECURE",
      "subsection": "Responsible Gun Control",
      "promise_text": "Toughen oversight of firearms licensing and strengthen the enforcement of yellow and red flag requirements by bolstering the capacity of Provincial Chief Firearms Officers to fulfill their obligations.",
      "source_page": 19,
      "source_ref": 304
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "End drug and human trafficking in our communities and boost resources to fight modern threats, such as foreign interference, transnational repression, and cybercrime.",
      "source_page": 19,
      "source_ref": 307
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "We will also recruit and train 1000 more RCMP personnel, establish a new RCMP academy within Depot, and increase pay for cadet recruits.",
      "source_page": 19,
      "source_ref": 308
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "Crack down on drugs, including fentanyl and its precursors, illegal guns, and stop gangs from smuggling stolen cars out of the country.",
      "source_page": 19,
      "source_ref": 309
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "We will train 1000 new Canada Border Services Agency (CBSA) officers.",
      "source_page": 19,
      "source_ref": 310
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "In addition, to secure our borders, we will stand up additional border scanners, drones, and new K-9 teams, to target more suspicious shipments at our land borders, ports, and railyards.",
      "source_page": 19,
      "source_ref": 311
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "Put those profiting from fentanyl behind bars by prosecuting more complex drug trafficking and organized crime offences.",
      "source_page": 19,
      "source_ref": 312
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "We will invest in the Public Prosecution Services of Canada so that they can do so.",
      "source_page": 19,
      "source_ref": 313
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "Amend the Canada Post Corporation Act to allow police to search for and seize fentanyl and other contraband in Canada Post mail with a general warrant.",
      "source_page": 19,
      "source_ref": 314
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "Support the health, including mental health, of our first responders by doubling our collaboration with the Canadian Institute of Health Research, and the Canadian Institute of Public Safety Research and Treatment.",
      "source_page": 19,
      "source_ref": 315
    },
    {
      "section": "SECURE",
      "subsection": "Resilient, Well-equipped Frontline Workers",
      "promise_text": "Amend the Public Service Superannuation Act to expand early retirement eligibility, also known as \"25 and out\" for frontline employees including firefighters, paramedics, correctional service employees, border services officers, Parliamentary protection officers, and search and rescue.",
      "source_page": 19,
      "source_ref": 316
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Make it harder to get bail for those charged with violent car theft, car theft for a criminal organization, home invasion, and certain human trafficking and smuggling offences by establishing a reverse onus for these crimes.",
      "source_page": 20,
      "source_ref": 320
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Require the court to prohibit possession of firearms or weapons when releasing someone charged with a violent offence or any offence involving a criminal organization.",
      "source_page": 20,
      "source_ref": 321
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Toughen sentencing guidelines so they are stricter for repeat offenders of car theft, as well as violent and organized crimes.",
      "source_page": 20,
      "source_ref": 322
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Direct courts to primarily consider denunciation and deterrence when sentencing repeat car thieves or home invasion offenders.",
      "source_page": 20,
      "source_ref": 323
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Allow for consecutive sentencing for car theft with violence or car theft involving a criminal organization on top of home invasion offences if applicable, or any other offences the person is subject to.",
      "source_page": 20,
      "source_ref": 324
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Allow for consecutive sentencing for serious and violent offences.",
      "source_page": 20,
      "source_ref": 325
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Make murder motivated by hate a constructive first-degree offence, including femicide.",
      "source_page": 20,
      "source_ref": 325
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Make it a criminal offence to distribute non-consensual sexual deepfakes.",
      "source_page": 20,
      "source_ref": 326
    },
    {
      "section": "SECURE",
      "subsection": "Safe at Home",
      "promise_text": "Increase penalties for the distribution of intimate images without consent and sexual assault on summary conviction.",
      "source_page": 20,
      "source_ref": 327
    },
    {
      "section": "SECURE",
      "subsection": "Keeping Children Safe",
      "promise_text": "Introduce legislation to protect children from horrific crimes including online sexploitation and extortion and give law enforcement and prosecutors the tools to stop these crimes and bring perpetrators to justice.",
      "source_page": 20,
      "source_ref": 330
    },
    {
      "section": "SECURE",
      "subsection": "Keeping Children Safe",
      "promise_text": "Provide new funding to the Canadian Center for Child Protection in Winnipeg, Manitoba.",
      "source_page": 20,
      "source_ref": 331
    },
    {
      "section": "SECURE",
      "subsection": "Keeping Children Safe",
      "promise_text": "Tighten laws to crack down on child-luring including by raising the maximum sentence.",
      "source_page": 20,
      "source_ref": 332
    },
    {
      "section": "SECURE",
      "subsection": "Keeping Children Safe",
      "promise_text": "Amend the Mandatory Reporting Act to extend the period of preservation of data related to a child sexual offence and extend the limitation period for the prosecution of an offence under that Act.",
      "source_page": 21,
      "source_ref": 334
    },
    {
      "section": "SECURE",
      "subsection": "Keeping Children Safe",
      "promise_text": "Prevent crime before it starts by extending the Building Safer Communities Fund, and prioritizing approaches to steer youth away from criminal activity.",
      "source_page": 21,
      "source_ref": 335
    },
    {
      "section": "SECURE",
      "subsection": "Protecting Our Communities",
      "promise_text": "Introduce legislation to make it a criminal offence to intentionally and willfully obstruct access to any place of worship, schools, and community centres.",
      "source_page": 21,
      "source_ref": 339
    },
    {
      "section": "SECURE",
      "subsection": "Protecting Our Communities",
      "promise_text": "Make it a criminal offence to intentionally and willfully intimidate or threaten those attending services at these locations.",
      "source_page": 21,
      "source_ref": 340
    },
    {
      "section": "SECURE",
      "subsection": "Protecting Our Communities",
      "promise_text": "Protect the safety of 2SLGBTQI+ people by maintaining support for Fierté Canada Pride in administering funding for security needs at Pride festivals across the country.",
      "source_page": 21,
      "source_ref": 341
    },
    {
      "section": "SECURE",
      "subsection": "Protecting Our Communities",
      "promise_text": "Address the rise of hate by implementing Canada's Action Plan on Combatting Hate.",
      "source_page": 21,
      "source_ref": 342
    },
    {
      "section": "SECURE",
      "subsection": "Protecting Our Communities",
      "promise_text": "Significantly increase the annual budget of the Canada Community Security Program in order to help protect vulnerable communities and places of worship.",
      "source_page": 21,
      "source_ref": 343
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Restore Canada's diplomatic presence abroad through a new, full foreign policy.",
      "source_page": 22,
      "source_ref": 359
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "We will also issue a complementary national security review.",
      "source_page": 22,
      "source_ref": 362
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Build alliances to protect our sovereignty including work to build a security and economic partnership with our Nordic partners to promote Arctic security, Canadian sovereignty, and reconciliation with Indigenous Peoples.",
      "source_page": 22,
      "source_ref": 362
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Defend our values of peace and stability by continuing to support Ukraine and Ukrainians including: working to bring home Ukrainian children stolen by Russia; building on Canadian leadership to seize Russian sovereign assets and using them to fund Ukraine's reconstruction; and, if needed, build on our peacekeeping heritage and step up to guarantee Ukraine's security.",
      "source_page": 22,
      "source_ref": 364
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Expand FinDev's lending capacity to support the private sector in low-income and emerging economies by investing in infrastructure that reduces emissions, addresses global famine and food insecurity, and closes economic development gaps.",
      "source_page": 22,
      "source_ref": 367
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Protect Canada's proud tradition of supporting the poorest and most vulnerable in times of crisis by maintaining our international humanitarian assistance budget at no less than \\$800 million per year.",
      "source_page": 22,
      "source_ref": 368
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Assert Canada's leadership in supporting women and girls by protecting funding for sexual and reproductive health care and rights, education, and combatting child marriage.",
      "source_page": 22,
      "source_ref": 369
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Add additional funding for the LGBTQI+ International Assistance Program to provide support for LGBTQI+ individuals facing persecution abroad, promote global equality, and partner with international organizations.",
      "source_page": 22,
      "source_ref": 371
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "We will also expand the Rainbow Refugee Assistance Partnership.",
      "source_page": 23,
      "source_ref": 373
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Continue our international climate finance program to focus on bringing in more private capital into helping developing economies reach their climate goals, while supporting the poorest and most vulnerable to adapt to the effects of climate change.",
      "source_page": 23,
      "source_ref": 374
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Leverage Canadian expertise to solve global problems including leveraging our tech ecosystem with increased funding to accelerate progress on the UN Sustainable Development Goals (SDGs).",
      "source_page": 23,
      "source_ref": 375
    },
    {
      "section": "SECURE",
      "subsection": "Global Leadership",
      "promise_text": "Use Canada's G7 Presidency to catalyze action in defence of our values, including working to protect the rules-based international order from those who want to destroy it.",
      "source_page": 23,
      "source_ref": 376
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Add thousands of new doctors to Canada's health care system by working with the provinces, territories and Indigenous Peoples to: Increase medical school and residency spaces, and build new medical schools and expand residency positions, especially for family medicine; Make it easier for internationally trained doctors and health professionals to practice in Canada; Address labour mobility issues and implement pan-Canadian licensure; Recruit qualified doctors through a new global recruitment strategy.",
      "source_page": 25,
      "source_ref": 396
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "We will consider the unique health care access needs of First Nations, Inuit, and Métis and establish a dedicated stream to increase access to medical care in areas of federal jurisdiction.",
      "source_page": 25,
      "source_ref": 398
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Make it easier to set up clinics in new communities through a new-practice fund to help family doctors with the costs of opening a practice, such as new clinic space and medical equipment and technologies.",
      "source_page": 25,
      "source_ref": 405
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Build hospitals, clinics, and more by investing \\$4 billion to construct and renovate community health care infrastructure.",
      "source_page": 25,
      "source_ref": 407
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "We will work with provinces and territories to accelerate this work and cost-share these investments.",
      "source_page": 25,
      "source_ref": 412
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "We will also work with First Nation, Inuit, and Métis communities to ensure improved access to these critical services.",
      "source_page": 25,
      "source_ref": 413
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Provide Personal Support Workers (PSWs) with up to \\$1,100 a year by immediately legislating a refundable Health Care Workers Hero Tax Credit.",
      "source_page": 25,
      "source_ref": 414
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Support training for nurses, PSWs, and teachers by expanding the Union Training and Innovation Program (UTIP) to include training spaces.",
      "source_page": 26,
      "source_ref": 416
    },
    {
      "section": "PROTECT",
      "subsection": "Improving Access to Health Care",
      "promise_text": "Protect and permanently fund Sexual and Reproductive Health Fund.",
      "source_page": 26,
      "source_ref": 418
    },
    {
      "section": "PROTECT",
      "subsection": "Better Mental Health Care",
      "promise_text": "Provide 100,000 young people a year with mental health care by establishing a permanent Youth Mental Health Fund.",
      "source_page": 26,
      "source_ref": 428
    },
    {
      "section": "PROTECT",
      "subsection": "Better Mental Health Care",
      "promise_text": "Provide urgent and immediate support to address the overdose crisis by adding \\$500 million to the Emergency Treatment Fund to support municipalities, Indigenous Peoples, and community health care organizations to confront the toxic drug and overdose crisis and connect more people to treatment and vital services, faster.",
      "source_page": 26,
      "source_ref": 430
    },
    {
      "section": "PROTECT",
      "subsection": "Better Mental Health Care",
      "promise_text": "Invest in deeply affordable housing, supportive housing, and shelters in recognition of the link between housing and mental health outcomes.",
      "source_page": 26,
      "source_ref": 431
    },
    {
      "section": "PROTECT",
      "subsection": "Better Mental Health Care",
      "promise_text": "Continue to fund the 9-8-8 suicide crisis helpline which responded to over 300,000 calls and texts in its first year.",
      "source_page": 27,
      "source_ref": 436
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "Significantly reduce wait times for life-saving medications.",
      "source_page": 27,
      "source_ref": 443
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "Ensure Canadians can securely access their health care data because your medical history should be available instantly to you and your doctor anytime and anywhere in Canada.",
      "source_page": 27,
      "source_ref": 446
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "We will table legislation to enable secure access to health data.",
      "source_page": 27,
      "source_ref": 447
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "Reduce the administrative burden on doctors with streamlined and standardized forms and scaling up digital tools that significantly reduce paperwork and leave more time for patient visits.",
      "source_page": 27,
      "source_ref": 449
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "And we will also launch a new program to support doctors in safely and securely adopting new digital tools such as e-prescribing and e-referrals.",
      "source_page": 27,
      "source_ref": 450
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "We will also support tools that are bilingual for doctors and nurses.",
      "source_page": 27,
      "source_ref": 451
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "Launch a Task Force for Public Health Care Innovation to invest and scale up made-in-Canada public health care solutions, leverage, and improve the quality of data, and evaluate and ensure accountability in public investments in health care, including the \\$25 billion Working Together Agreements signed with provinces and territories.",
      "source_page": 27,
      "source_ref": 452
    },
    {
      "section": "PROTECT",
      "subsection": "Modernize Canada's Public Health Care System",
      "promise_text": "Implement a national licence for physicians and nurses, giving health workers more mobility across the country and making it easier to respond to workforce needs across jurisdictions.",
      "source_page": 27,
      "source_ref": 453
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Protect and strengthen \\$10-a-day Early Learning and Child Care (ELCC) system to create 100,000 new spaces by 2031.",
      "source_page": 28,
      "source_ref": 460
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Ensure ELCC providers have good wages, which is critical to keeping child care centres staffed.",
      "source_page": 28,
      "source_ref": 462
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "We will work with provinces and territories so that workers have predictable wage increases and investments in pensions and benefits programs.",
      "source_page": 28,
      "source_ref": 463
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Require provinces, territories, and municipalities to expand child care in public infrastructure wherever possible, including in schools and community centres, and in community infrastructure that receives federal financing, so families can get child care close to home.",
      "source_page": 28,
      "source_ref": 464
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Link child care with housing development on sites that receive federal financing or affordable housing funds.",
      "source_page": 28,
      "source_ref": 465
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Make the National School Food Program permanent.",
      "source_page": 28,
      "source_ref": 467
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "And we will prioritize Canadian-made food as much as possible.",
      "source_page": 28,
      "source_ref": 472
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Continue to advance the National Caregiving Strategy.",
      "source_page": 28,
      "source_ref": 473
    },
    {
      "section": "PROTECT",
      "subsection": "Support for Families",
      "promise_text": "Protect and deliver the Canada Child Benefit, which helps low- and middle-income families afford the costs of raising a child.",
      "source_page": 29,
      "source_ref": 479
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Protect more nature by advancing the creation of at least 10 new National Parks and Marine Protected Areas; supporting the creation of 15 new urban parks and green spaces in municipalities; halting and reversing nature and biodiversity loss through reinforced efforts to conserve 30% of lands and waters by 2030; and implementing the Global Biodiversity Framework.",
      "source_page": 29,
      "source_ref": 487
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Protect more of our freshwater as it becomes increasingly attractive to foreign actors by developing a National Water Security Strategy and prohibiting their inclusion in trade deals.",
      "source_page": 29,
      "source_ref": 490
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "We will also create a strategic water security technology fund to advance development of related Canadian R&D, Al, monitoring, and data tools.",
      "source_page": 29,
      "source_ref": 491
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "We will also modernize the Canada Water Act to address evolving challenges.",
      "source_page": 29,
      "source_ref": 492
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "And through the Canada Water Agency, we will strengthen national water stewardship and launch a municipal stream under the Freshwater Action Plan for regions facing freshwater challenges and equipping them to safeguard local water resources.",
      "source_page": 29,
      "source_ref": 493
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "We will also invest in the deployment of new technologies and enforcement efforts in the fight against aquatic invasive species.",
      "source_page": 29,
      "source_ref": 494
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Launch the Canadian Nature Protection Fund to restore old-growth forests, safeguard carbon-rich peatlands, and revive our coastal waters.",
      "source_page": 29,
      "source_ref": 496
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Conserve nature in partnership with Indigenous Peoples by expanding the Indigenous Guardians Program to include 50 new Arctic Indigenous Guardians.",
      "source_page": 30,
      "source_ref": 500
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Champion nature conservation internationally by stopping illegal wildlife trade across our borders with modern digital solutions; ratifying the High Seas Treaty as soon as possible; and supporting growth of our marine resource sectors, while advocating for strong evidence-based international protections.",
      "source_page": 30,
      "source_ref": 501
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Improving Parks Canada's disaster response capabilities... We will invest to ensure our national parks have a well-resourced response force including expanding and equipping Parks Canada's wildfire response teams with additional training and modern firefighting equipment to meet emerging wildfire threats.",
      "source_page": 30,
      "source_ref": 503
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "We will increase investment in FireSmart programs, including strategic debris clearing and controlled burns; ensure comprehensive evacuation planning for all communities within national parks, developed in collaboration with local and Indigenous partners; update building codes and infrastructure standards for all new constructions in national parks, ensuring climate-resilient design that accounts for future wildfire and climate risks.",
      "source_page": 30,
      "source_ref": 505
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Prioritize natural infrastructure, like forested areas and wetlands.",
      "source_page": 30,
      "source_ref": 508
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Map Canada's ecologically sensitive areas. We will map Canada's carbon and biodiversity-rich ecological landscapes - including ocean coastlines, peatlands, and permafrost areas - to enable a more holistic ecosystem approach to conservation, carbon accounting, and project development.",
      "source_page": 30,
      "source_ref": 510
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Proactively rehabilitate and mitigate environmental and species at risk impacts in areas where we expect there to be significant infrastructure development over the next five years.",
      "source_page": 30,
      "source_ref": 511
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Nature",
      "promise_text": "Connect Canadians with nature by making access to national parks and historic sites free for this summer.",
      "source_page": 30,
      "source_ref": 515
    },
    {
      "section": "PROTECT",
      "subsection": "Official Languages",
      "promise_text": "Establish a 12% target for Francophone immigration outside of Quebec by 2029, a 20% increase from current targets.",
      "source_page": 31,
      "source_ref": 524
    },
    {
      "section": "PROTECT",
      "subsection": "Official Languages",
      "promise_text": "Support entrepreneurs in Official Language Minority Communities looking to scale their businesses, notably by facilitating access to Francophone and bilingual workers.",
      "source_page": 31,
      "source_ref": 526
    },
    {
      "section": "PROTECT",
      "subsection": "Official Languages",
      "promise_text": "Continue to invest in community spaces for English-speaking minorities in Quebec and French speaking minorities across the country.",
      "source_page": 31,
      "source_ref": 527
    },
    {
      "section": "PROTECT",
      "subsection": "Official Languages",
      "promise_text": "Promote French-language educational pursuits across Canada by collaborating with provinces and territories to invest in educational and community spaces, such as early learning and child care that serve official language minority communities; creating a scholarship for Francophone students who continue their post-secondary studies in French in a minority context.",
      "source_page": 31,
      "source_ref": 528
    },
    {
      "section": "PROTECT",
      "subsection": "Official Languages",
      "promise_text": "Protect and modernize CBC/Radio-Canada to ensure that it continues to provide vital programming in both French and English.",
      "source_page": 31,
      "source_ref": 530
    },
    {
      "section": "PROTECT",
      "subsection": "Seniors",
      "promise_text": "Protect Canadians' retirement savings from volatile market conditions by reducing the minimum amount that must be withdrawn from a Registered Retirement Income Fund (RRIF) by 25% for one year.",
      "source_page": 32,
      "source_ref": 536
    },
    {
      "section": "PROTECT",
      "subsection": "Seniors",
      "promise_text": "Give a temporary income boost to low-income seniors by increasing the Guaranteed Income Supplement (GIS) by 5%, providing up to an additional \\$652 in income per year, tax-free.",
      "source_page": 32,
      "source_ref": 539
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Get young Canadians started with their first job by connecting young people with the jobs and skill development opportunities they need to launch their professional lives.",
      "source_page": 32,
      "source_ref": 547
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Provide funding and expand the mandates, where appropriate, for the Student Work Placement Program, the Youth Employment and Skills Strategy (YESS), Canada Summer Jobs, and the Canadian Service Corps.",
      "source_page": 32,
      "source_ref": 549
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Establish a Youth Climate Corps pilot which will provide paid skills training for young Canadians to quickly respond to climate emergencies, support recovery, and strengthen resilience in communities across the country.",
      "source_page": 32,
      "source_ref": 552
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Continue to uphold the removal of interest on Canada Student Loans and Canada Apprentice Loans.",
      "source_page": 33,
      "source_ref": 555
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Make generational housing investments to double the pace of construction and drive down the cost of homes, rent, and mortgage payments.",
      "source_page": 33,
      "source_ref": 556
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Offer the Canada Strong Pass so young Canadians can discover Canada this summer.",
      "source_page": 33,
      "source_ref": 558
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Provide 100,000 young people a year with mental health care by establishing a permanent Youth Mental Health Fund.",
      "source_page": 33,
      "source_ref": 559
    },
    {
      "section": "PROTECT",
      "subsection": "Young Canadians",
      "promise_text": "Provide a new Apprenticeship Grant of up to \\$8,000 for registered apprentices.",
      "source_page": 33,
      "source_ref": 560
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Stand up for the Canadian Charter of Rights and Freedoms, protecting the values it was founded on, which are under threat, and ensuring the protection of our most vulnerable people.",
      "source_page": 33,
      "source_ref": 568
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Enable Canadians to take more action to affirm their rights by expanding the Court Challenges Program.",
      "source_page": 33,
      "source_ref": 569
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Build a Canada where everyone has a fair shot, feels a sense of belonging, and contributes to our shared future by reshaping systems to better reflect and support all Canadians and make sure that no matter your heritage or identity you can fully participate in Canada.",
      "source_page": 33,
      "source_ref": 570
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Confront systemic barriers and create opportunities for Indigenous Peoples, Black Canadians, and racialized communities, ensuring equal treatment and access in all aspects of Canadian society.",
      "source_page": 34,
      "source_ref": 572
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Make funding permanent for the 2SLGBTQI+ Community Capacity Fund to support community organizations and networks that protect rights and advance equality across Canada.",
      "source_page": 34,
      "source_ref": 573
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Review and reform the process to apply for the Disability Tax Credit (DTC) now that the DTC has become the gateway to key federal programs like the Canada Disability Benefit, the CCB for children with disabilities, the dental benefit, and various other programs.",
      "source_page": 34,
      "source_ref": 574
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "We will also consider expanding the eligibility criteria to include additional impairments.",
      "source_page": 34,
      "source_ref": 575
    },
    {
      "section": "PROTECT",
      "subsection": "Party of the Charter, Party of Equal Rights",
      "promise_text": "Guarantee equal access to justice for people with disabilities by developing a Disability Justice Framework to address long-standing inequities, biases, and systemic discrimination against persons with disabilities within the justice system and before the law.",
      "source_page": 34,
      "source_ref": 576
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Make the Sexual and Reproductive Health Fund Program permanent, so that there will always be funding for abortion care in Canada, with access to reproductive care protected for underserved communities.",
      "source_page": 34,
      "source_ref": 581
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Establish a new in vitro fertilization (IVF) program that provides up to \\$20,000 for a single standard cycle of IVF treatment, making it more affordable for Canadians who want to become parents, especially 2SLGBTQI+ Canadians who face a costly journey to parenthood.",
      "source_page": 34,
      "source_ref": 582
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "We will work with the provinces and territories to make sure more Canadians can access this support.",
      "source_page": 34,
      "source_ref": 583
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Address the under-researched area of postpartum maternal health by investing in research into postpartum maternal health to fund studies and track outcomes, disparities, and service gaps, and inform future investments so that women get better care after giving birth.",
      "source_page": 34,
      "source_ref": 584
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Invest in increased collection of data to help address women's health gaps in Canada, particularly in understudied areas of menopause, endometriosis, maternal mortality and morbidity, stillbirth, and perinatal health.",
      "source_page": 34,
      "source_ref": 585
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Work to end gender-based violence by continuing investments in the National Action Plan to End Gender-Based Violence so that we can support victims and survivors, prevent violence from happening in the first place, and support Indigenous-led approaches that will be prioritized in partnership.",
      "source_page": 35,
      "source_ref": 587
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Unlock new economic opportunities for women by increasing support for the Women's Economic and Leadership Opportunities Fund.",
      "source_page": 35,
      "source_ref": 590
    },
    {
      "section": "PROTECT",
      "subsection": "Protect Women's Rights and Prosperity",
      "promise_text": "Protect and strengthen child care in Canada.",
      "source_page": 35,
      "source_ref": 593
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Work in full partnership with First Nation, Inuit, and Métis to advance and realize the rights of Indigenous Peoples through a distinctions-based approach.",
      "source_page": 35,
      "source_ref": 602
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Support Indigenous-led processes for advancing self-determination and the exercise of jurisdiction in priority areas such as education, health, child and family services as well as community safety and policing.",
      "source_page": 35,
      "source_ref": 603
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Work in partnership on the implementation of treaties, land claim, and self-government agreements.",
      "source_page": 35,
      "source_ref": 604
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Commit to developing and supporting, in partnership, the structures that support a nation-to-nation, Inuit-Crown, government-to-government relationship to progress on shared priorities.",
      "source_page": 36,
      "source_ref": 605
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Move forward on the important work of the Truth and Reconciliation Commission's Calls to Action and support Indigenous communities to uncover unmarked and undocumented graves and burial sites at residential schools.",
      "source_page": 36,
      "source_ref": 606
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Move forward on the implementation of the National Inquiry into Missing and Murdered Indigenous Women and Girls Calls for Justice and the National Action Plan.",
      "source_page": 36,
      "source_ref": 607
    },
    {
      "section": "PROTECT",
      "subsection": "Reconciliation with Indigenous Peoples",
      "promise_text": "Implement the United Nations Declaration on the Rights of Indigenous Peoples Act and the Action Plan.",
      "source_page": 36,
      "source_ref": 608
    },
    {
      "section": "PROTECT",
      "subsection": "Lifelong Education and Training (Indigenous)",
      "promise_text": "Launch a new Indigenous Pathways to Prosperity Skills and Training Fund which will support partnerships between First Nations, Inuit, and Métis communities and organizations, schools, training centres, and colleges to advance access to skills training and education opportunities.",
      "source_page": 36,
      "source_ref": 611
    },
    {
      "section": "PROTECT",
      "subsection": "Lifelong Education and Training (Indigenous)",
      "promise_text": "Accelerate funding for access to post-secondary education so more First Nations, Inuit, and Métis students can go to school and invest in associated infrastructure.",
      "source_page": 36,
      "source_ref": 613
    },
    {
      "section": "PROTECT",
      "subsection": "Lifelong Education and Training (Indigenous)",
      "promise_text": "We will also invest in Indigenous-led post-secondary education institutions such as the Inuit Nunangat University and the First Nations University.",
      "source_page": 36,
      "source_ref": 614
    },
    {
      "section": "PROTECT",
      "subsection": "Lifelong Education and Training (Indigenous)",
      "promise_text": "Protect K-12 education on-reserve so that more First Nations kids can go to school surrounded by their language, culture, and communities.",
      "source_page": 36,
      "source_ref": 615
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Expand the Indigenous Loan Guarantee Program from \\$5 billion to \\$10 billion and increase the sectoral scope.",
      "source_page": 36,
      "source_ref": 617
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Expand the kinds of projects the Canada Infrastructure Bank can support to be more in line with First Nation, Inuit, and Métis priorities.",
      "source_page": 37,
      "source_ref": 624
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Explore options for an Indigenous Infrastructure Bank to address access to capital.",
      "source_page": 37,
      "source_ref": 625
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Determine the best path forward towards First Nations 10-year infrastructure plans.",
      "source_page": 37,
      "source_ref": 626
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Realize First Nations control over First Nations infrastructure wherever possible through models like the First Nations Atlantic Water Authority.",
      "source_page": 37,
      "source_ref": 627
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Work in partnership with Indigenous communities and Indigenous housing providers to directly support building housing including in urban, rural, and northern Indigenous communities.",
      "source_page": 37,
      "source_ref": 628
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Increase lands added to reserves within the next four years and work with First Nations to accelerate additions to reserve.",
      "source_page": 37,
      "source_ref": 629
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Immediately introduce and pass legislation affirming that First Nations have a human right to clean drinking water.",
      "source_page": 37,
      "source_ref": 630
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Revitalize Indigenous languages by supporting community-driven projects that restore, protect, and promote this important part of First Nations, Inuit, and Métis cultures and histories.",
      "source_page": 37,
      "source_ref": 631
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Increase investments for Indigenous mental health, healing and wellness centres, and friendship centres.",
      "source_page": 37,
      "source_ref": 632
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Co-develop evidence-based food security approaches to replace Nutrition North Canada with Inuit and Northern Indigenous leaders.",
      "source_page": 37,
      "source_ref": 633
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Double First Nation, Inuit, and Métis capacity funding to contribute to major project assessments for more consistent, fair, and meaningful consultations.",
      "source_page": 37,
      "source_ref": 636
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Establish a new Indigenous Climate Readiness and Adaptation Fund and support Indigenous-led conservation initiatives to safeguard forests, waterways, oceans and wildlife and to bolster disaster response activities.",
      "source_page": 37,
      "source_ref": 637
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Work with First Nation, Inuit, and Métis peoples to advance economic reconciliation, including reforms that enable Indigenous-led initiatives.",
      "source_page": 37,
      "source_ref": 639
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Continue to support Indigenous Early Learning and Child Care.",
      "source_page": 38,
      "source_ref": 642
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Continue to partner with Inuit to eliminate tuberculosis in Inuit Nunangat by 2030.",
      "source_page": 38,
      "source_ref": null
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Continue to fund Jordan's Principle.",
      "source_page": 38,
      "source_ref": 643
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Continue to fund Inuit Child First Initiative.",
      "source_page": 38,
      "source_ref": 643
    },
    {
      "section": "PROTECT",
      "subsection": "Stronger, Healthier Indigenous Communities",
      "promise_text": "Continue the work on child welfare reform.",
      "source_page": 38,
      "source_ref": null
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Cut income taxes for the middle class and save dual-income families up to \\$825 a year.",
      "source_page": 39,
      "source_ref": 662
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "We will reduce the marginal tax rate on the lowest tax bracket by 1 percentage point.",
      "source_page": 39,
      "source_ref": 663
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Cut the GST for first-time homebuyers on homes up to \\$1 million.",
      "source_page": 40,
      "source_ref": 666
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "In recognition of the high costs of homes in more expensive housing markets, we will also lower the GST on homes between \\$1 million and \\$1.5 million for first-time buyers.",
      "source_page": 40,
      "source_ref": 669
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Get Canadians the benefits they deserve by delivering automatic tax filing starting with low-income households and seniors.",
      "source_page": 40,
      "source_ref": 670
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Make mortgage payments more affordable by reviewing Canada's mortgage market with the objective to offer Canadians more options while retaining stability in the market.",
      "source_page": 40,
      "source_ref": 672
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Fund home retrofits and lower utility bills while making it easier for low- and middle-income households, including renters, to adopt heat pumps and energy efficiency upgrades.",
      "source_page": 40,
      "source_ref": 674
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Lower household risks to floods and wildfires, directly helping Canadian families to protect against floods, wildfires, and other extreme weather events.",
      "source_page": 40,
      "source_ref": 676
    },
    {
      "section": "BUILD",
      "subsection": "Building an Economy Everyone Can Afford",
      "promise_text": "Amend the Greenhouse Gas Pollution Pricing Act to legislate the repeal of the consumer \"carbon tax\" after Mark Carney's government cancelled it on Day One, in March 2025.",
      "source_page": 40,
      "source_ref": 679
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Create Build Canada Homes (BCH) to get the federal government back into the business of building homes.",
      "source_page": 42,
      "source_ref": 696
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Act as a developer to build affordable housing at scale, including on public lands.",
      "source_page": 42,
      "source_ref": 697
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Build faster, smarter, sustainable, more affordable homes by providing over \\$25 billion in financing to innovative prefabricated home builders in Canada, including those using Canadian technologies and resources like mass timber and softwood lumber.",
      "source_page": 42,
      "source_ref": 699
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Support affordable homebuilders by injecting \\$10 billion in low-cost financing and capital for homes that support middle- and low-income Canadians.",
      "source_page": 42,
      "source_ref": 702
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Prioritize sustainable building including sustainably sourced wood, recycled content, and low-emissions materials.",
      "source_page": 42,
      "source_ref": 704
    },
    {
      "section": "BUILD",
      "subsection": "Build Canada Homes",
      "promise_text": "Incentivize companies to hire apprentices and recent graduates by establishing new requirements on federal contribution agreements to major projects that commit industry partners to include significant opportunities for young Canadians.",
      "source_page": 42,
      "source_ref": 705
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Cut municipal development charges in half for multi-unit residential housing for five years by working with provinces and territories to keep municipalities whole.",
      "source_page": 42,
      "source_ref": 710
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Reintroduce a tax incentive for home builders known as the Multi-Unit Rental Building (MURB), which, in the 1970s, spurred tens of thousands of rental housing units across the country.",
      "source_page": 43,
      "source_ref": 713
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Facilitate the conversion of existing structures into affordable housing units.",
      "source_page": 43,
      "source_ref": 714
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Build on the success of the Housing Accelerator Fund, further reducing housing bureaucracy, zoning restrictions, and other red tape so that builders only need to navigate one housing market, instead of thirteen.",
      "source_page": 43,
      "source_ref": 715
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Speed up approvals by reforming and simplifying national building codes; eliminating duplicative inspections and streamlining regulations for prefabricated and modular housing; leveraging pre-approved, standardized housing designs across all public lands and encouraging the adoption of the designs as-of-right across the country; allowing builders and other orders of government to apply for multiple projects at once; and fast tracking builders who have a proven record with government.",
      "source_page": 43,
      "source_ref": 717
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Build federal homes in ways that reduce the risk of costly damages.",
      "source_page": 43,
      "source_ref": 721
    },
    {
      "section": "BUILD",
      "subsection": "A Better Housing Market",
      "promise_text": "Stand up Canada's high-risk flood insurance program by April 2026 to support homeowners to reduce their exposure to future climate risk.",
      "source_page": 43,
      "source_ref": 724
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Return immigration to sustainable levels by capping the total number of temporary workers and international students to less than 5% of Canada's population by the end of 2027, from a past high of 7.3%, to ease the strain on housing, public infrastructure, and our social services.",
      "source_page": 44,
      "source_ref": 738
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Stabilize permanent resident admissions at less than 1% of Canada's population annually beyond 2027 with a focus on attracting top global talent that will drive economic growth and prosperity.",
      "source_page": 44,
      "source_ref": 739
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Attract the best talent in the world to build our economy by revitalizing the Global Skills Strategy to help high-growth Canadian businesses and entrepreneurs with new projects that will support Canada's strategic economic growth.",
      "source_page": 44,
      "source_ref": 741
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Work with provinces and territories to streamline and speed up recognition of foreign credentials and international professional experience, so that those who come to Canada can contribute their skills to the economy more quickly upon arrival.",
      "source_page": 44,
      "source_ref": 743
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Work towards a fairer and faster process and enhance service delivery for applicants by leveraging digital service tools to reduce processing times and eliminate backlogs to ensure that our immigration system is more reliable for families, businesses, and applicants.",
      "source_page": 44,
      "source_ref": 744
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Support legal aid for asylum seekers and refugees so that claimants receive timely advice and representation, have their cases resolved as quickly as possible, and reduce unnecessary appeals.",
      "source_page": 44,
      "source_ref": 745
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Move forward with a credible and fair immigration system that removes failed claimants once due process has been accorded, reinforcing the system's integrity.",
      "source_page": 44,
      "source_ref": 746
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Strengthen the integrity of the border by increasing resources for security screenings, quickly identifying and removing inadmissible individuals, tightening visa requirements, and enhancing enforcement against immigration fraud.",
      "source_page": 44,
      "source_ref": 747
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Continue to respect that immigration, both permanent and temporary, is a shared responsibility with the Government of Quebec.",
      "source_page": 44,
      "source_ref": 748
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Establish a 12% target for Francophone immigration outside of Quebec by 2029, a 20% increase from current targets, to strengthen Francophone communities throughout Canada.",
      "source_page": 45,
      "source_ref": 751
    },
    {
      "section": "BUILD",
      "subsection": "Immigration",
      "promise_text": "Strengthen federal, provincial, and territorial collaboration by enhancing cooperation between governments, agencies, and organizations to enable real-time information sharing on claimant status, removals, and settlement supports to improve efficiency and service delivery.",
      "source_page": 45,
      "source_ref": 752
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Kickstart the clean energy supply chain by investing in critical minerals, attracting investment in critical minerals to get them from \"rock to road\" faster, supporting early-stage mining companies, and supporting thousands of jobs across the supply chain.",
      "source_page": 46,
      "source_ref": 773
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Connect critical mineral projects to supply chains through a new First and Last Mile Fund (FLMF).",
      "source_page": 46,
      "source_ref": 774
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Directly support clean energy and critical mineral projects through the FLMF, reducing our reliance on other countries and protecting Canadian jobs.",
      "source_page": 46,
      "source_ref": 776
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Accelerate exploration and extraction, including investing in prospecting activities and recovering valuable minerals from end-of-life products like mining waste and batteries, contributing to a circular economy.",
      "source_page": 46,
      "source_ref": 777
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Attract, expand, and derisk investments in critical minerals exploration and extraction through the expansion of existing tax credits by: Broadening the Critical Mineral Exploration Tax Credit by expanding qualifying minerals; Expanding eligible activities under Canadian exploration expenses to include the costs of technical studies; Modifying the Clean Technology Manufacturing Investment Tax Credit to include critical mineral mine development expenses for brownfield sites while expanding the list of priority critical minerals.",
      "source_page": 46,
      "source_ref": 778
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Invest in ourselves by providing funding for projects of national and economic significance and leveraging the Canada Growth Fund to accelerate private investment in Canadian critical minerals projects.",
      "source_page": 46,
      "source_ref": 783
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Expand Canada's electric vehicle (EV) charging network by supporting the building of thousands of new stations by 2027.",
      "source_page": 46,
      "source_ref": 785
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "We will also look at ways to reintroduce a purchase incentive worth up to \\$5,000 that supports Canadian workers and strengthens our domestic supply chains.",
      "source_page": 46,
      "source_ref": 785
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Examine measures to reduce Canada's reliance on imported clean fuels as part of our plan to support Canadian farmers and businesses.",
      "source_page": 47,
      "source_ref": 788
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Move forward on Canada's six major investment tax credits (ITCs) that support clean energy and technology - the Carbon Capture, Utilization, and Storage ITC, Clean Technology ITC, Clean Electricity ITC, Clean Hydrogen ITC, Clean Technology Manufacturing ITC, and Electric Vehicle Supply Chain ITC.",
      "source_page": 47,
      "source_ref": 789
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Continue to be a world leader in Carbon Capture, Utilization, and Storage technology so that Canada is a world leader in responsible energy production.",
      "source_page": 47,
      "source_ref": 790
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Expedite project reviews, including for major energy infrastructure.",
      "source_page": 47,
      "source_ref": 791
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Bring our energy potential to the world.",
      "source_page": 47,
      "source_ref": 792
    },
    {
      "section": "BUILD",
      "subsection": "Energy Superpower, Energy Security",
      "promise_text": "Safeguard our resources from predatory investors.",
      "source_page": 47,
      "source_ref": 792
    },
    {
      "section": "BUILD",
      "subsection": "Clean Investment, Growth, and Good Jobs",
      "promise_text": "Finalize and implement the voluntary made-in-Canada sustainable investment guidelines for every priority sector by fall 2026.",
      "source_page": 47,
      "source_ref": 796
    },
    {
      "section": "BUILD",
      "subsection": "Clean Investment, Growth, and Good Jobs",
      "promise_text": "Issue Canada's first-ever transition bonds by 2027, to finance projects that help industrial and agricultural sectors get cleaner and more competitive.",
      "source_page": 47,
      "source_ref": 796
    },
    {
      "section": "BUILD",
      "subsection": "Clean Investment, Growth, and Good Jobs",
      "promise_text": "Lead by example and reduce energy bills, in government-owned buildings by phasing out fossil fuel use by 2030.",
      "source_page": 47,
      "source_ref": 798
    },
    {
      "section": "BUILD",
      "subsection": "Clean Investment, Growth, and Good Jobs",
      "promise_text": "Ensure new federal buildings will be top performers in energy efficiency by adopting the top tiers for energy efficiency and greenhouse gas emissions reductions.",
      "source_page": 48,
      "source_ref": 800
    },
    {
      "section": "BUILD",
      "subsection": "Clean Investment, Growth, and Good Jobs",
      "promise_text": "Invest in the prefabricated and modular housing industry to reduce home construction emissions by up to 22% compared to traditional construction methods.",
      "source_page": 48,
      "source_ref": 802
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Make sure big emitters pay while protecting the competitiveness of Canadian industry.",
      "source_page": 48,
      "source_ref": 805
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Enable opportunities for big polluters to support consumers in lowering their carbon footprint.",
      "source_page": 48,
      "source_ref": 808
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Promote fair competition with our trading partners by developing a Carbon Border Adjustment Mechanism.",
      "source_page": 48,
      "source_ref": 810
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Support carbon contracts for difference to derisk investments in the clean economy and further foster Canada's clean industrial competitive advantage.",
      "source_page": 48,
      "source_ref": 814
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Become a world leader in carbon removal and sequestration by establishing Canada as a world leading hub for carbon removal and sequestration technology.",
      "source_page": 48,
      "source_ref": 816
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Establish broad coverage of climate risk disclosure for companies across Canada.",
      "source_page": 49,
      "source_ref": 819
    },
    {
      "section": "BUILD",
      "subsection": "A Made-in-Canada Industrial Competitiveness Strategy",
      "promise_text": "Speed up the approval of clean energy projects while upholding environmental rigour and Indigenous rights.",
      "source_page": 49,
      "source_ref": 821
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Reduce the cost of investment for Canadian companies and make sure they are internationally competitive by extending immediate expensing for manufacturing or processing machinery and equipment, clean energy generation, energy conservation equipment, and zero-emission vehicles, as well as the Accelerated Investment Incentive.",
      "source_page": 50,
      "source_ref": 836
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Drive increased private sector investment in research and development by increasing, to \\$6 million, the claimable amount under the Scientific Research and Experimental Development Tax Incentive Program (SR&ED) for Canadian companies, along with other reforms, to drive economic growth for small- and medium-sized businesses.",
      "source_page": 50,
      "source_ref": 837
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Invest in our homegrown startups by recapitalizing the Venture Capital Catalyst Initiative (VCCI) by \\$1 billion.",
      "source_page": 50,
      "source_ref": 839
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Incentivize investment in innovation, especially in Canada's startups, to help them grow and scale by introducing flow-through shares to our Canadian startup ecosystem, supporting companies in Al, quantum computing, biotech, and advanced manufacturing to raise money faster.",
      "source_page": 50,
      "source_ref": 843
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Bring IP back to Canada and attract talent by creating a Canada Patent Box that will reward builders who locate or stay in Canada.",
      "source_page": 50,
      "source_ref": 846
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Make the Black Entrepreneurship Program permanent and provide ongoing funding to support Black-owned businesses.",
      "source_page": 50,
      "source_ref": 849
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Secure the Canadian advantage in strategic industries like biomanufacturing, quantum computing, and ag-tech.",
      "source_page": 50,
      "source_ref": 852
    },
    {
      "section": "BUILD",
      "subsection": "Helping Builders Build",
      "promise_text": "Invest in the Women’s Economic and Leadership Opportunities Fund.",
      "source_page": 51,
      "source_ref": 856
    },
    {
      "section": "BUILD",
      "subsection": "The Economy of the Future",
      "promise_text": "Build AI infrastructure by: Investing in nation-building energy infrastructure and cutting red tape to make Canada the best place in the world to build data centres; Building the next generation of data centres quickly and efficiently by leveraging federal funding and partnering with the private sector to secure Canada’s technological advantage.",
      "source_page": 51,
      "source_ref": 870
    },
    {
      "section": "BUILD",
      "subsection": "The Economy of the Future",
      "promise_text": "Invest in AI training, adoption, and commercialization by: Measuring growth by tracking the economic impacts of AI in real-time; Boosting adoption with a new AI deployment tax credit for small and medium-sized businesses; Catalyze commercialization by expanding successful programs at Canada’s AI institutes (Mila, Vector, Amii).",
      "source_page": 52,
      "source_ref": 873
    },
    {
      "section": "BUILD",
      "subsection": "The Economy of the Future",
      "promise_text": "Improve AI procurement by: Establishing a dedicated Office of Digital Transformation at the centre of government; Enabling the Office of Digital Transformation to centralize innovative procurement and take a whole-of-government approach to service delivery improvement.",
      "source_page": 52,
      "source_ref": 877
    },
    {
      "section": "BUILD",
      "subsection": "Championing Science and Research",
      "promise_text": "Attract leading researchers to Canadian institutions by creating the Canadian Sovereignty and Resilience Research Fund.",
      "source_page": 53,
      "source_ref": 888
    },
    {
      "section": "BUILD",
      "subsection": "Championing Science and Research",
      "promise_text": "Finalize Canada’s modernization of science and research, through the creation of a capstone organization that will ensure the federal granting agencies are driving mission-driven research that brings Canadian expertise to big global challenges and effectively commercializes homegrown ideas.",
      "source_page": 53,
      "source_ref": 892
    },
    {
      "section": "BUILD",
      "subsection": "Championing Science and Research",
      "promise_text": "Enable the fuller inclusion of people with disabilities in academic, social, and professional life by requiring Canadian publishers to provide an accessible copy of all e-books produced or released in Canada by 2030.",
      "source_page": 53,
      "source_ref": 893
    },
    {
      "section": "BUILD",
      "subsection": "Employment Insurance for All Workers",
      "promise_text": "Continue to support workers affected by President Trump’s unjust trade war through the revenues from counter tariffs.",
      "source_page": 53,
      "source_ref": 903
    },
    {
      "section": "BUILD",
      "subsection": "Employment Insurance for All Workers",
      "promise_text": "Strengthen our social safety net and ensure no one is left behind. As a priority over the next year, we will work to enhance the Employment Insurance system to better reflect the modern workforce with flexible, reliable support.",
      "source_page": 54,
      "source_ref": 908
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Provide a new Apprenticeship Grant of up to \\$8,000 for registered apprentices.",
      "source_page": 54,
      "source_ref": 915
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Increase access to union-led training initiatives by permanently doubling the funding of the Union Training and Innovation Program from \\$25 million to \\$50 million.",
      "source_page": 54,
      "source_ref": 920
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Establish a new \\$20 million capital funding stream for colleges to support new training spaces, such as classrooms, for apprenticeships.",
      "source_page": 54,
      "source_ref": 922
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Uphold the Apprenticeship Service program to support employers in hiring new apprentices in Red Seal trades, with \\$5,000 for first-year apprentices and \\$10,000 for women, people with disabilities, and other underrepresented groups.",
      "source_page": 54,
      "source_ref": 924
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Increase labour mobility for skilled trades people between provinces and territories to address labour shortages.",
      "source_page": 55,
      "source_ref": 925
    },
    {
      "section": "BUILD",
      "subsection": "Skilled Trades",
      "promise_text": "Expand the Labour Mobility Tax Deduction to ensure workers who travel more than 120 km from their home to a job site can deduct their expenses.",
      "source_page": 55,
      "source_ref": 927
    },
    {
      "section": "BUILD",
      "subsection": "Training",
      "promise_text": "Launch a new training and upskilling benefit worth up to \\$15,000 for workers in the middle of their careers.",
      "source_page": 55,
      "source_ref": 933
    },
    {
      "section": "BUILD",
      "subsection": "Training",
      "promise_text": "Ensure that Canadian workers impacted by tariffs have the necessary tools to pursue good paying jobs and advance their careers in priority sectors.",
      "source_page": 55,
      "source_ref": 936
    },
    {
      "section": "BUILD",
      "subsection": "Training",
      "promise_text": "Futureproof the workforce by ensuring federally funded training programs better align with labour market needs, which means meeting the needs of employers today, and the employers of tomorrow.",
      "source_page": 55,
      "source_ref": 938
    },
    {
      "section": "BUILD",
      "subsection": "Building New Markets for Canadian Goods",
      "promise_text": "Open a \\$25 billion export credit facility to support Canadian businesses as they expand into new markets.",
      "source_page": 56,
      "source_ref": 947
    },
    {
      "section": "BUILD",
      "subsection": "Building New Markets for Canadian Goods",
      "promise_text": "Help Canadian businesses diversify their markets by expanding the CanExport program and pivoting it to focus on diversifying from the United States and fully take advantage of our existing trade deals, such as CETA and CPTPP.",
      "source_page": 56,
      "source_ref": 949
    },
    {
      "section": "BUILD",
      "subsection": "Building New Markets for Canadian Goods",
      "promise_text": "Pursue new trade deals with MERCOSUR and ASEAN so that Canadian businesses can access markets worth \\$9 trillion combined.",
      "source_page": 56,
      "source_ref": 950
    },
    {
      "section": "BUILD",
      "subsection": "Building New Markets for Canadian Goods",
      "promise_text": "Modernize Canada’s Special Import Measures Act to respond to the new international trade reality, particularly to update Canada’s trade remedy tools in situations of circumvention or diversion, including legislating express timelines for safeguard actions.",
      "source_page": 56,
      "source_ref": 951
    },
    {
      "section": "BUILD",
      "subsection": "Building New Markets for Canadian Goods",
      "promise_text": "Build trade enabling infrastructure to diversify our trade away from the United States, create new jobs, and build one Canadian economy.",
      "source_page": 56,
      "source_ref": 952
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Spend less, so Canada can invest more.",
      "source_page": 56,
      "source_ref": 957
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Balance the operating budget by Budget 2028, ensuring responsible fiscal management while making wise, long-term investments to build for Canada’s prosperity and future.",
      "source_page": 56,
      "source_ref": 959
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Ensure the federal government’s capital investment dollars catalyze multiple times their value in private investment.",
      "source_page": 56,
      "source_ref": 960
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Ensure that government debt-to-GDP declines over the budget horizon.",
      "source_page": 57,
      "source_ref": 963
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Protect transfers to individuals (e.g. pensions, EI, CCB payments, etc.) and to provinces and territories (e.g. Equalization, Canadian Health Transfer, Canada Social Transfer, and Territorial Formula Financing).",
      "source_page": 57,
      "source_ref": 964
    },
    {
      "section": "BUILD",
      "subsection": "Building Responsibly",
      "promise_text": "Protect social programs including \\$10-a-day child care, dental care, and pharmacare.",
      "source_page": 57,
      "source_ref": 965
    },
    {
      "section": "BUILD",
      "subsection": "Tax Fairness",
      "promise_text": "Conduct an expert review of the corporate tax system based on the principles of fairness, transparency, simplicity, sustainability, and competitiveness.",
      "source_page": 57,
      "source_ref": 967
    },
    {
      "section": "BUILD",
      "subsection": "Tax Fairness",
      "promise_text": "Lead an international effort with partners in Europe and across the G7 to get a fair and consistent set of international tax rules completed, as proposed by the Organization for Economic Cooperation and Development (OECD).",
      "source_page": 57,
      "source_ref": 968
    },
    {
      "section": "BUILD",
      "subsection": "Tax Fairness",
      "promise_text": "Leverage technology at the Canada Revenue Agency to better identify and prosecute instances of tax evasion, fix loopholes, and strengthen enforcement.",
      "source_page": 57,
      "source_ref": 970
    }
  ]
}
